OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_UAC_HID/main.c
            uac_dev = usbh_uac_get_device_list();

            if (uac_dev == NULL)
                continue;

            if (uac_dev != NULL)              /* should be newly connected UAC device */
            {
                usbh_uac_open(uac_dev);

                uac_control_example(uac_dev);

                usbh_uac_start_audio_out(uac_dev, audio_out_callback);

                usbh_uac_start_audio_in(uac_dev, audio_in_callback);
            }

            hdev_list = usbh_hid_get_device_list();
            hdev = hdev_list;

            while (hdev != NULL)
            {
                if (is_a_new_hid_device(hdev))
                {
                    init_hid_device(hdev);
                }

                hdev = hdev->next;
            }

            update_hid_device_list(hdev_list);
        }

        if (uac_dev == NULL)
        {
            //update hid
            hdev_list = usbh_hid_get_device_list();
            update_hid_device_list(hdev_list);
            s_i8AuInCnt = 0;
            s_i8AuOutCnt = 0;

            if (!kbhit())
            {
                i8Ch = getchar();
                usbh_memory_used();
            }

            continue;
        }

        if (!kbhit())
        {
            i8Ch = getchar();

            if ((i8Ch == '+') && (g_u16VolCur + g_u16VolRes <= g_u16VolMax))
            {
                printf("+");
                u16Val = g_u16VolCur + g_u16VolRes;

                if (usbh_uac_vol_control(uac_dev, UAC_MICROPHONE, UAC_SET_CUR, UAC_CH_MASTER, &u16Val) == UAC_RET_OK)
                {
                    printf("    Microphone set volume 0x%x success.\n", u16Val);
                    g_u16VolCur = u16Val;
                }
                else
                    printf("    Failed to set microphone volume 0x%x!\n", u16Val);
            }
            else if ((i8Ch == '-') && (g_u16VolCur - g_u16VolRes >= g_u16VolMin))
            {
                printf("-");
                u16Val = g_u16VolCur - g_u16VolRes;

                if (usbh_uac_vol_control(uac_dev, UAC_MICROPHONE, UAC_SET_CUR, UAC_CH_MASTER, &u16Val) == UAC_RET_OK)
                {
                    printf("    Microphone set volume 0x%x success.\n", u16Val);
                    g_u16VolCur = u16Val;
                }
                else
                    printf("    Failed to set microphone volume 0x%x!\n", u16Val);
            }
            else if ((i8Ch == '0') && (g_u16VolCur - g_u16VolRes >= g_u16VolMin))
            {
                if (usbh_uac_vol_control(uac_dev, UAC_MICROPHONE, UAC_GET_CUR, UAC_CH_MASTER, &g_u16VolCur) == UAC_RET_OK)
                    printf("    Microphone current volume is 0x%x.\n", g_u16VolCur);
                else
                    printf("    Failed to get microphone current volume!\n");
            }
            else
            {
                printf("IN: %d, OUT: %d\n", s_i8AuInCnt, s_i8AuOutCnt);
                usbh_memory_used();
            }

        }  /* end of kbhit() */
    }
}
